avr-rust/avrd/packs/xmegaa/ATxmega16A4U.atdf
        <register caption="DACB1 Calibration Byte 1" name="DACB1GAINCAL" offset="0x37" size="1"/>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="QFP_QFN_44">
      <pin pad="PA5" position="1"/>
      <pin pad="PA6" position="2"/>
      <pin pad="PA7" position="3"/>
      <pin pad="PB0" position="4"/>
      <pin pad="PB1" position="5"/>
      <pin pad="PB2" position="6"/>
      <pin pad="PB3" position="7"/>
      <pin pad="GND" position="8"/>
      <pin pad="VCC" position="9"/>
      <pin pad="PC0" position="10"/>
      <pin pad="PC1" position="11"/>
      <pin pad="PC2" position="12"/>
      <pin pad="PC3" position="13"/>
      <pin pad="PC4" position="14"/>
      <pin pad="PC5" position="15"/>
      <pin pad="PC6" position="16"/>
      <pin pad="PC7" position="17"/>
      <pin pad="GND" position="18"/>
      <pin pad="VCC" position="19"/>
      <pin pad="PD0" position="20"/>
      <pin pad="PD1" position="21"/>
      <pin pad="PD2" position="22"/>
      <pin pad="PD3" position="23"/>
      <pin pad="PD4" position="24"/>
      <pin pad="PD5" position="25"/>
      <pin pad="PD6" position="26"/>
      <pin pad="PD7" position="27"/>
      <pin pad="PE0" position="28"/>
      <pin pad="PE1" position="29"/>
      <pin pad="GND" position="30"/>
      <pin pad="VCC" position="31"/>
      <pin pad="PE2" position="32"/>
      <pin pad="PE3" position="33"/>
      <pin pad="PDI" position="34"/>
      <pin pad="RESET" position="35"/>
      <pin pad="PR0" position="36"/>
      <pin pad="PR1" position="37"/>
      <pin pad="GND" position="38"/>
      <pin pad="AVCC" position="39"/>
      <pin pad="PA0" position="40"/>
      <pin pad="PA1" position="41"/>
      <pin pad="PA2" position="42"/>
      <pin pad="PA3" position="43"/>
      <pin pad="PA4" position="44"/>
    </pinout>
    <pinout name="BGA_49">
      <pin pad="PA3" position="A1"/>
      <pin pad="AVCC" position="A2"/>
      <pin pad="GND" position="A3"/>
      <pin pad="PR1" position="A4"/>
      <pin pad="PR0" position="A5"/>
      <pin pad="PDI_DATA" position="A6"/>
      <pin pad="PE3" position="A7"/>
      <pin pad="PA4" position="B1"/>
      <pin pad="PA1" position="B2"/>
      <pin pad="PA0" position="B3"/>
      <pin pad="GND" position="B4"/>
      <pin pad="RESET" position="B5"/>
      <pin pad="PE2" position="B6"/>
      <pin pad="VCC" position="B7"/>
      <pin pad="PA5" position="C1"/>
      <pin pad="PA2" position="C2"/>
      <pin pad="PA6" position="C3"/>
      <pin pad="PA7" position="C4"/>
      <pin pad="GND" position="C5"/>
      <pin pad="PE1" position="C6"/>
      <pin pad="GND" position="C7"/>
      <pin pad="PB1" position="D1"/>
      <pin pad="PB2" position="D2"/>
      <pin pad="PB3" position="D3"/>
      <pin pad="PB0" position="D4"/>
      <pin pad="GND" position="D5"/>
      <pin pad="PD7" position="D6"/>
      <pin pad="PE0" position="D7"/>
      <pin pad="GND" position="E1"/>
      <pin pad="GND" position="E2"/>
      <pin pad="PC3" position="E3"/>
      <pin pad="GND" position="E4"/>
      <pin pad="PD4" position="E5"/>
      <pin pad="PD5" position="E6"/>
      <pin pad="PD6" position="E7"/>
      <pin pad="VCC" position="F1"/>
      <pin pad="PC0" position="F2"/>
      <pin pad="PC4" position="F3"/>
      <pin pad="PC6" position="F4"/>
      <pin pad="PD0" position="F5"/>
      <pin pad="PD1" position="F6"/>
      <pin pad="PD3" position="F7"/>
      <pin pad="PC1" position="G1"/>
      <pin pad="PC2" position="G2"/>
      <pin pad="PC5" position="G3"/>
      <pin pad="PC7" position="G4"/>
      <pin pad="GND" position="G5"/>
      <pin pad="VCC" position="G6"/>
      <pin pad="PD2" position="G7"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
